app/controllers/school_classes_controller.rb

SELECT "school_classes".* FROM "school_classes"
---
    def index
        @classes = SchoolClass.all

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @class = SchoolClass.find(params[:id])

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "computer science"], ["room_number", 5], ["created_at", "2019-11-25 00:46:10.688676"], ["updated_at", "2019-11-25 00:46:10.688676"]]
---
    def create
        @class = SchoolClass.create(class_params)

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @class = SchoolClass.find(params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "math"], ["updated_at", "2019-11-25 01:08:53.631663"], ["id", 1]]
---
    def update
        @class = SchoolClass.find(params[:id])
        @class.update(class_params)